{
  "greet": "Hi, I'm Alex",
  "title": "Front-End Web Developer",
  "description": " based in Canada with experience developing applications in JavaScript and React with UI libraries.",
  "contact": "Contact",
  "skills": "My skills",
  "cv": "Get my CV",
  "mywork": "My work",
  "myworkd": "These are some of the projects I've built.",
  "myworkb": "Some of my abilities",
  "cancel": "Close",
  "billcrest": {
    "des": "Hello",
    "p1": "Billcrest is a Point Of Sales system with forms for creating, reading, updating, and deleting data. The state management would be handled by Redux, allowing for easy data manipulation and updates across the application.",
    "try": "Try it out:",
    "header1": "What is it?",
    "header2": "What can you do in this app?",
    "modify": "Modify user personal information, such as name, email address, and phone number allowing users to manage their account settings.",
    "manage": "Track inventory levels in real-time and update inventory counts.",
    "crud": "CRUD: You can use the app to create, read, update and delete new records in the database.",
    "charts": "Provide a visual representation of data that is easy to understand and interpret using charts. This can help users to quickly identify trends and patterns, and make informed decisions based on the data.",
    "invoice": "Process sales transactions: You can use the app to process sales transactions, including accepting payment by credit card, debit card, or cash. The app can also calculate the total cost of the purchase, including taxes and any discounts."
  },
  "moviesearch": {
    "p1": "This is a small web-based application that allows users to search for information about movies, such as movie titles and release date. The app retrieves data from an API(The Open Movie DataBase, OMDb) and displays the results in a user-friendly format.",
    "header1": "What did I learn?",
    "li1": "Use the hook useRef to avoid doing the same request to the API",
    "li2": "Manipulate and manage data retrieved from APIs for faster retrieval.",
    "li3": "Implement search algorithms that can handle various search queries and filters.",
    "li4": "Work with third-party APIs to retrieve movie data.",
    "li5": "Optimize app performance for faster loading times and smoother user experience.",
    "li6": "Paginate data that can help break the data into smaller chunks that can be loaded as needed."
  },
  "mytimeline": "Learning path",
  "timelinedes": "Timeline illustrating my progress and growth in learning.",
  "timelinebackt": "Professional Development",
  "timeline": {
    "college": "Acquired the technical skills and knowledge required to develop high quality dynamic websites and web applications.",
    "coursera": "This course provided me a comprehensive and structured learning path to acquire the skills and knowledge necessary to become a proficient web developer.",
    "billcrest": "Through my learning and practice, I deepened my knowledge and expertise in working with a POS system, performing CRUD operations, making HTTP requests, and effectively managing data using Redux.",
    "moviesearch": "Through my learning and experimentation, I broadened my range of skills in paginating data, and I became proficient in using useRef to enhance the search functionality and optimize HTTP requests.",
    "mysql": "Currently learning about how to create a database and make connection to a restful API.",
    "node": "Currently learning about how to create a simple restful API using Node and Express with the best practices.",
    "keywords": "Responsible for analyze and report software defects accurately using tools like Jira, and alert the development team about the issues found.",
    "learning": "Currently learning...",
    "ecommerce": "E-commerce website based on the Abercrombie web page created using Typescript and Next. Also taking this opportunity to learn and practice new features of Next, like App Router."
  },
  "ecommerce": {
    "p1": "It's an e-commerce platform, allowing customers to browse and purchase their products online. Users can visit the website, browse through collections of products, select the items they wish to purchase, and add them to their shopping cart."
  },
  "inDev": "In Development"
}
